app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Rush Hour"], ["rating", "R"], ["release_date", "1998-09-18 00:00:00.000000"], ["created_at", "2024-10-08 00:58:34.934800"], ["updated_at", "2024-10-08 00:58:34.934800"]]
---
    def add_movie
      #Since this Add movie button makes a post request,
      #you will need to create a route and a controller action for it.
      title_params = params[:title]
      rating_params = params[:rating]
      release_date = params[:release_date]
      description_params = params[:description]
      @movie = Movie.create!(title: title_params, rating: rating_params, description: description_params, release_date: release_date)